Tekla Open API Reference for Tekla Structures 2025
IRelatedObjects Interface
 The IRelatedObjects interface is implemented by objects that have related objects.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IRelatedObjects
Public Interface IRelatedObjects
Methods
Name | Description
GetRelatedObjects()
 Gets the related objects of the current object.
GetRelatedObjects(Type[])
 Gets the related objects of the current object that are of certain types.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace